{
  "users": [
    {
      "id": "1",
      "name": "Babel Coder",
      "email": "babelcoder@gmail.com",
      "password": "$2a$12$Ri986F2pvt/XwR6aQ6DR7uisBGgKxSI0H8ulx2c3aeuZSxuZp5AKK"
    }
  ],
  "articles": [
    {
      "id": "1",
      "authorId": "1",
      "title": "เจาะลึกการใช้งาน List, Tuple, Dictionary และ Set ในภาษา Python",
      "excerpt": "คอลเล็กชันที่สำคัญในภาษา Python ที่เราจะหยิบยกมาพูดถึงกัน ได้แก่ List, Tuple, Dictionary และ Set และเนื่องจากบทความนี้เป็นบทความต่อเนื่องจาก เจาะลึก classes และ objects ใน Python 3 ผู้อ่านจึงควรอ่านบทความดังกล่าวก่อนครับ เพื่อป้องกันสภาวะตบะแตกที่จะพึงเจอได้ในบทความนี้",
      "content": "ข้อมูลถือเป็นสิ่งสำคัญในทุกภาษาไม่ว่านั่นจะเป็นภาษามนุษย์หรือภาษาโปรแกรมก็ตาม\nวัตถุต่างๆบนโลกเราสามารถปาดนิ้วไปชี้พร้อมบอกว่า นี่คือหมู นั่นคือหมา และโน่นคือนายกได้ ลักษณะแบบนี้คือการบ่งชี้ข้อมูลตัวเดียว\nนายกไม่ได้มีแค่คนเดียวฉันใด ข้อมูลก็ไม่จำเป็นต้องอยู่โดดเดี่ยวฉันนั้น เราสามารถรวมกลุ่มสิ่งของที่สัมพันธ์กันเพื่อจัดเป็นก้อนเดียวกันได้ เช่น ขีปนาวุธ 5 ลูก เครื่องบินรบอีก 9 ลำ พร้อมกับหมูคุโรบูตะอีกพันล้านตัว แบบนี้เราเรียกว่าคอลเล็กชัน (Collection)\nคอลเล็กชันที่สำคัญในภาษา Python ที่เราจะหยิบยกมาพูดถึงกัน ได้แก่ List, Tuple, Dictionary และ Set และเนื่องจากบทความนี้เป็นบทความต่อเนื่องจาก เจาะลึก classes และ objects ใน Python 3 ผู้อ่านจึงควรอ่านบทความดังกล่าวก่อนครับ เพื่อป้องกันสภาวะตบะแตกที่จะพึงเจอได้ในบทความนี้"
    },
    {
      "id": "2",
      "authorId": "1",
      "title": "เจาะลึก classes และ objects ใน Python 3",
      "excerpt": "Object Oriented Programming (OOP) เป็นหลักการที่ขยายพันธุ์ไปในหลายๆภาษาอย่างรวดเร็ว ราวกับหมู่อะมีบาในหน้าฝน Python ก็เป็นหนึ่งในภาษาที่โดนวิญญาณอะมีบาเข้าสิง เราจึงได้เห็นความเป็น OOP ฉบับ Python อย่างที่มีและไม่มีในภาษาอื่น",
      "content": "Object Oriented Programming (OOP) เป็นหลักการที่ขยายพันธุ์ไปในหลายๆภาษาอย่างรวดเร็ว ราวกับหมู่อะมีบาในหน้าฝน Python ก็เป็นหนึ่งในภาษาที่โดนวิญญาณอะมีบาเข้าสิง เราจึงได้เห็นความเป็น OOP ฉบับ Python อย่างที่มีและไม่มีในภาษาอื่น"
    },
    {
      "id": "3",
      "authorId": "1",
      "title": "GraphQL Best Practices: สร้าง GraphQL ให้คูลยังไง? ตอนที่ 2",
      "excerpt": "เมื่อพระเจ้าสร้างโลก RESTful API ได้ถูกบรรจุลงสมองโปรแกรมเมอร์เป็นที่เรียบร้อย พวกเขาเหล่านั้นจึงเขียน API ได้โลดโผนไม่ต่างอะไรจากลิงโหนต้นไม้ในป่าอเมซอน",
      "content": "ความที่พระเจ้าฝัง REST ใส่หัวโปรแกรมเมอร์มาแต่เกิด เราจึงรู้ว่าควรวางโครงสร้างโปรเจคเช่นไรเพื่อให้จัดการได้ง่ายในสถาปัตยกรรมแบบ REST แต่สำหรับ GraphQL นั้น แรกๆก็ดูง่ายแต่พอใช้ไปใช้มาแล้วเริ่มรู้สึก… นอกเจ้าเจ้านายก็ GraphQL นี่หละที่เป็นพญามารตัวที่สองของชีวิต~"
    },
    {
      "id": "4",
      "authorId": "1",
      "title": "เรียนรู้การใช้ภาษา Go ใน 15 นาที",
      "excerpt": "Go เป็นอีกหนึ่งภาษาโปรแกรมที่ป็อบปูล่าสุดๆ เนื้อหอมน่าตามล่ายิ่งกว่าเจ๊ปูน้ำในหูไม่เท่ากันซะอีก",
      "content": "เพราะภาษาส่วนใหญ่มักมีหลายสิ่งเหมือนกัน จะให้โปรแกรมเมอร์ไปเริ่มภาษาใหม่ด้วยการนั่งอ่านวิธีประกาศตัวแปร ความหมายของ character หรือรู้จักว่า if statement และ for loop ต่างกันยังไง โลกนี้คงตายด้านน่าดู คิดแล้วขอบินไปเปิดหูเปิดตาที่ดูไบบ้างจะดีกว่า"
    },
    {
      "id": "5",
      "authorId": "1",
      "title": "อนาคตของ JavaScript จะมี Syntax อะไรเพิ่มบ้าง?",
      "excerpt": "ภาษามนุษย์ไม่ว่าจะภาษาไทยหรือภาษาอังกฤษเราไม่ได้เรียนรู้กันในคืนเดียว จะให้เปลี่ยนหรือเรียนภาษาที่สองยังยาก ไม่ต้องพูดถึงภาษาที่สามหรือสี่เลย แต่ถ้าได้ซักห้าภาษา… คุณก็คือ นาธาน แล้วครับ",
      "content": "ไม่ใช่สำหรับภาษาโปรแกรมที่ผุดกันเป็นดอกเห็ดเผาะในหน้าฝน ภาษาไหนที่เจ๋งหน่อยก็จะมีคนคอยสนับสนุนทำไลบรารี่ดีๆให้ นักพัฒนาก็จะคลานเข่าเข้าสวามิภักดิ์และหมอบกราบกลางสายฝน แล้วที่ยืนของภาษาที่ไม่เก๋าพอหละอยู่ตรงไหน?"
    },
    {
      "id": "6",
      "authorId": "1",
      "title": "Git ฮับ ก็มีโค้ดแปลกๆและตลกนะ",
      "excerpt": "Git ฮับ~ (Github) นั้นไม่เพียงแต่เป็นแหล่งรวมโอเพนซอร์ส แต่ยังเป็นศูนย์รวมความแปลกและตลก (ฝืด) ครบวงจรที่จะพาคุณฮาจนไส้ปลิ้น ไม่ต้องพล่ามเยอะ ไปฮาจนน้ำหมากกระจายได้กับโปรเจคต่อไปนี้ฮับ",
      "content": "ขึ้นชื่อว่านักพัฒนา Ruby on Rails ไม่มีใครไม่รู้จัก Sidekiq ไลบรารี่สำหรับทำ Background Job ที่เคลมว่าตัวเองเบาหวิวกระโปรงปลิวกว่าคู่แข่งอย่าง Resque แต่นั่นไม่ใช่ประเด็นของเรา จุดหมายเราคือหาตุ๊กกี้ (ดาราตลก) ที่ซ่อนตัวอยู่ในโค้ดต่างหาก"
    },
    {
      "id": "7",
      "authorId": "1",
      "title": "JavaScript: มีอะไรใหม่บ้างใน ES8 (ES2017)",
      "excerpt": "ES8 หรือ ES2017 พึ่งคลอดอย่างเป็นทางการเมื่อไม่นานนี้ ทว่าการอัพเกรดเวอร์ชันครั้งนี้ไม่ได้มีอะไรหวือหวาชนิดที่ต้องร้องกรี๊ดจนตับไหม้ นั่นเพราะฟีเจอร์หลักๆใน ES8 เราๆท่านๆก็ใช้กันเป็นปกติกับวุ้นแปลภาษาสุดวิเศษที่ชื่อว่า Babel กันอยู่แล้ว คิดอะไรไม่ออกจับ Babel ใส่ stage-0 โลด… แล้วคุณจะได้ทุกอย่างที่ต้องการ",
      "content": "ES8 หรือ ES2017 พึ่งคลอดอย่างเป็นทางการเมื่อไม่นานนี้ ทว่าการอัพเกรดเวอร์ชันครั้งนี้ไม่ได้มีอะไรหวือหวาชนิดที่ต้องร้องกรี๊ดจนตับไหม้ นั่นเพราะฟีเจอร์หลักๆใน ES8 เราๆท่านๆก็ใช้กันเป็นปกติกับวุ้นแปลภาษาสุดวิเศษที่ชื่อว่า Babel กันอยู่แล้ว คิดอะไรไม่ออกจับ Babel ใส่ stage-0 โลด… แล้วคุณจะได้ทุกอย่างที่ต้องการ"
    }
  ]
}
